W7D4/goal_app/app/controllers/users_controller.rb

    def show
        debugger
        @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]