W11D3/classwork/BenchBnB/benchproj/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "wfdcgEV/VF0="], ["updated_at", "2020-04-23 00:06:26.194198"], ["id", 2]]
---
  def reset_session_token
    self.session_token = SecureRandom.base64(8)
    self.save!