W11D2/Pokedex/app/controllers/api/pokemons_controller.rb

  def show
    @pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def index
    @pokemons = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"